Revit 2027 API
BuiltInFailures.ForeignFileFailures.ForeignLink Property
 This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ForeignLink { get; }
Public Shared ReadOnly Property ForeignLink As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ForeignLink {
	FailureDefinitionId^ get ();
}
static member ForeignLink : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ForeignFileFailures Class
Autodesk.Revit.DB Namespace